n0_dict = {1: 'один', 2: 'два', 3: 'три', 4: 'четыре', 5: 'пять',
           6: 'шесть', 7: 'семь', 8: 'восемь', 9: 'девять'}
n1_dict = {11: 'одиннадцать', 12: 'двенадцать', 13: 'тринадцать',
           14: 'четырнадцать', 15: 'пятнадцать', 16: 'шестнадцать',
           17: 'семнадцать', 18: 'восемнадцать', 19: 'девятнадцать'}
n2_dict = {10: 'десять', 20: 'двадцать', 30: 'тридцать', 40: 'сорок', 50: 'пятьдесят',
           60: 'шестьдесят', 70: 'семьдесят', 80: 'восемьдесят', 90: 'девяносто'}
n3_dict = {100: 'сто', 200: 'двести', 300: 'триста', 400: 'четыреста', 500: 'пятьсот',
           600: 'шестьсот', 700: 'семьсот', 800: 'восемьсот', 900: 'девятьсот'}

while True:
    string_form = input("Введите целое число от 1 до 999: ")
    if string_form.isdigit():
        if 1 <= int(string_form) <= 999:
            break
n = int(string_form)
n_100 = n//100 * 100
n_10_all = n % 100
n_10 = n_10_all//10 * 10
n_1 = n % 10

dct = []
if n_100 in n3_dict:
    dct.append(n3_dict[n_100])
if n_10_all in n1_dict:
    dct.append(n1_dict[n_10_all])
else:
    if n_10 in n2_dict:
        dct.append(n2_dict[n_10])
    if n_1 in n0_dict:
        dct.append(n0_dict[n_1])
print(" ".join(dct))